{
	"author": "Cortex XSOAR Customer Success",
	"authorImage": "",
	"beta": false,
	"cacheVersn": 0,
	"categories": [
		"Case Management"
	],
	"certification": "",
	"contentItemTypes": [
		"automation",
		"incidenttype",
		"report",
		"dashboard",
		"playbook",
		"classifier",
		"layoutscontainer",
		"widget"
	],
	"contentItems": {
		"automation": [
			{
				"description": "Dynamic display script to display a response process on an Incident layout. The response process display can change depending on the Incident Type.",
				"name": "CaseMgmtResponseProcess",
				"tags": [
					"dynamic-section"
				]
			},
			{
				"description": "Dynamic section that will display the Labels for an Incident in a markdown table. ",
				"name": "CaseMgmtDisplayLabels",
				"tags": [
					"dynamic-section"
				]
			},
			{
				"description": "Restricts the Incident Types a user can create manually, based on their assigned XSOAR Role(s). \n\nRequirements - Create an XSOAR List called IncidentTypeRBAC with the following structure, the names must match exactly to the names in the Incident Types under Settings!\n\nExample List:\n{\n\"Default\":[\"Case\",\"Job\",\"Unclassified\"],\n\"Analyst\":[\"Phishing\",\"Malware\"],\n\"ThreatHunters\":[\"Hunt\"]\n}",
				"name": "CaseMgmtIncidentTypesByRole",
				"tags": [
					"field-display"
				]
			},
			{
				"description": "Dynamic display script to display a list of useful Analyst Tools on an Incident layout.\n\nCreate an XSOAR list called \"Case Management Analyst Tools\", and add a markdown table to provide your own list.",
				"name": "CaseMgmtAnalystTools",
				"tags": [
					"dynamic-section"
				]
			},
			{
				"description": "Stops the \"Time To Assignment\" timer once an owner is assigned to the Incident\nStarts the \"Remediation SLA' timer once an owner is assigned to the Incident",
				"name": "TimersOnOwnerChange",
				"tags": [
					"field-change-triggered"
				]
			},
			{
				"description": "This is an SLA breach script that will complete playbook tasks tagged with 'timerbreach' when the SLA breaches. \n\nThis can be used to complete tasks waiting for manual input when a timer breaches its SLA, and move the playbook along.",
				"name": "CompleteTaskOnTimerBreach",
				"tags": [
					"sla"
				]
			},
			{
				"description": "Restricts the Incident Types a user can create manually based on an XSOAR list, and prevents changing the Incident Type manually once it is created.\n\nRequirements - Create an XSOAR List called IncidentTypesFromList a list of comma separated Incident Types\n\nIncident Type 1,Incident Type 2, Incident Type 3 ",
				"name": "CaseMgmtIncidentTypesDisplay",
				"tags": [
					"field-display"
				]
			},
			{
				"description": "Adds an XSOAR User to the Incident, this automation can be used as part of a playbook task.",
				"name": "AddUserToIncidentTeam",
				"tags": [
					"Utility"
				]
			},
			{
				"description": "Post Processing Script that will close linked Incidents when the Incident is closed. Will set the same close code as the parent, and add closing notes from the parent. ",
				"name": "CloseLinkedIncidentsPostProcessing",
				"tags": [
					"post-processing",
					"training",
					"internal"
				]
			}
		],
		"classifier": [
			{
				"description": "This mapper will set the labels for all Incidents created using it for either the system default Incident type, or the Case Type.   Can be used to quickly ingest alerts from any source without any specific mapping.",
				"id": "Case Management - Generic Mapper",
				"name": "Case Management - Generic Mapper"
			}
		],
		"dashboard": [
			{
				"name": "My Incidents"
			},
			{
				"name": "Incidents Overview"
			}
		],
		"genericfield": null,
		"generictype": null,
		"incidentfield": null,
		"incidenttype": [
			{
				"closureScript": "",
				"days": 0,
				"hours": 0,
				"name": "Case",
				"playbook": "Case Management - Generic v2",
				"weeks": 0
			}
		],
		"indicatorfield": null,
		"integration": null,
		"layoutscontainer": [
			{
				"description": "",
				"name": "Case Management Layout v2"
			},
			{
				"description": "",
				"name": "Case layout"
			}
		],
		"list": null,
		"playbook": [
			{
				"description": "This playbook can be used to send email notification if an Incidents severity is Critical or High.  \n\nCan be used as a sub-playbook to perform the same logic across different playbooks/use cases.",
				"name": "Case Management - Generic - Send On Call Notification"
			},
			{
				"description": "This playbook will extract and enrich indicators upon trigger, calculate Severity, and set SLAs and Timers. \n\nCan be used as a default playbook to ingest new Incidents, or for manually created Incidents. ",
				"name": "Case Management - Generic v2"
			},
			{
				"description": "This playbook will start the Time to Assignment or Remediation SLA timers based on whether an Owner is assigned to the Incident.\n\nCan be used as a sub-playbook to perform the same logic across different playbooks/use cases.",
				"name": "Case Management - Generic - Start SLA Timers"
			},
			{
				"description": "This playbook executes when no other playbook is associated with an incident. It enriches indicators in an incident using one or more integrations.",
				"name": "Case Management - Generic"
			},
			{
				"description": "Sets the SLAs for Incidents, the Time to Assignment Timer, and the Remediation SLA Timer based on the Incident Severity.",
				"name": "Case Management - Generic - Set SLAs based on Severity"
			}
		],
		"report": [
			{
				"description": "Investigation Summary Report from Case Management Pack",
				"name": "Case Report"
			}
		],
		"reputation": null,
		"widget": [
			{
				"name": "Participating Incidents Count"
			},
			{
				"name": "Participating Incidents"
			},
			{
				"name": "Mean Time to Assignment (Time to Assignment)"
			},
			{
				"name": "My Incidents by Type"
			},
			{
				"name": "Mean Time to Remediation (Remediation SLA)"
			},
			{
				"name": "My Mean Time to Remediation (Remediation SLA)"
			}
		],
		"wizard": null
	},
	"currentVersion": "1.4.8",
	"definitionId": "",
	"dependencies": {
		"Base": {
			"author": "Cortex XSOAR",
			"certification": "certified",
			"mandatory": true,
			"minVersion": "1.34.27",
			"name": "Base"
		},
		"CommonPlaybooks": {
			"author": "Cortex XSOAR",
			"certification": "certified",
			"mandatory": true,
			"minVersion": "2.6.34",
			"name": "Common Playbooks"
		},
		"CommonScripts": {
			"author": "Cortex XSOAR",
			"certification": "certified",
			"mandatory": true,
			"minVersion": "1.15.23",
			"name": "Common Scripts"
		},
		"CommonTypes": {
			"author": "Cortex XSOAR",
			"certification": "certified",
			"mandatory": false,
			"minVersion": "3.5.6",
			"name": "Common Types"
		}
	},
	"deprecated": false,
	"description": "Case Management - Generic\n\nBuilt by the Cortex Customer Success Team to provide quick deployment of Case Management with XSOAR",
	"disabledMonthly": false,
	"downloads": 5691,
	"eulaLink": "https://github.com/demisto/content/blob/master/LICENSE",
	"fromServerVersion": "5.0.0",
	"general": [
		"generalFieldFree"
	],
	"id": "CaseManagement-Generic",
	"installMessage": "",
	"integrations": [],
	"itemVersion": "1.4.8",
	"keywords": [
		"Case Management",
		"SIEM"
	],
	"legacy": true,
	"name": "CaseManagement-Generic",
	"packID": "CaseManagement-Generic",
	"packName": "",
	"premium": false,
	"previewOnly": false,
	"price": 0,
	"propagationLabels": [
		"all"
	],
	"rawKeywords": null,
	"rawTags": null,
	"rawUseCases": null,
	"readme": "# Case Management Pack Implementation Guide\n\nWhether you're creating Incidents manually in XSOAR, or fetching from a SIEM, this pack provides some helpful content to help with those goals.\n\n## Default Incident Type\n\nThis Pack includes an Incident Type of '**Case**', which has optimized layouts for Case Management, including for manual Incident creation.  To use this as a default for XSOAR, navigate to +Settings -\u003e Advanced -\u003e Incident Types+ and select Case and Set as Default.\n\n## Incident Ingestion\n\nSetting Case as the default type means you can enable a fetch from any integration and it will default to this type.  \n\nUse the **Case Management - Generic Mapper** and all data from the incoming incident will be added and displayed in the labels section.  This means you can quickly bring in alerts from various systems, and then further tune the data, layouts, and playbooks as future improvements.\n\n## Layouts\n\nThe Case type has an optimized layout for both the summary pages, and the new/edit screen.  This layout includes some useful action buttons for Analysts to utilize in their day to day.\n\nThis layout can be used as a template for future Incident types you create in your system.\n\n## Playbook\n\nThe default playbook for the Case type is **Case Management - Generic v2**, this playbook is very simple, but does have a few optional add-ons you might want to enable.  At it's core the playbook simply does the following:\n\n- Extract \u0026 Enrich Indicators: Extract IOCs (hashes, ips, urls) from the incoming Incident data, and mark these items as a note.\n- Calculate Severity\n- Set SLAs for the Incident or the Time to Assign or Remediation SLA Timers\n- Start Timers\n- Send email notification for Incidents of Critical or High Severity\n- Pause and wait for Analyst review\n\n### Timers\n\nOptionally this playbook has built in Timers for adding metrics for Mean Time to Assignment or Mean Time to Remediation to the metrics you are tracking in the system.  To take advantage of these timers, you can add the included **TimersOnOwnerChange** script to as a field trigger script on the Owner field.   This script will stop the Time to Assignment timer and start the Remediation SLA timer when an owner is first assigned to the Incident.\n\nTo set this up:\n\n1. +Settings -\u003e Objects Setup -\u003e Incidents -\u003e Fields+\n2. Find and edit the Owner field\n3. Select **TimersOnOwnerChange** on the 'Script to run when field value changes' option\n\n## Dashboards\n\nThis pack includes 2 dashboards:\n\n- **Incident Overview**: High level summary of all Incidents in the system, by type, severity, owner, unassigned, etc.\n- **My Incidents**: Analyst focused dashboard for them to work Incidents assigned to them or Incidents they are participating in.  This dashboard also shows any War Room chats they may have been mentioned in.\n\n### Optional Widgets\n\nThere are 3 optional widgets you can add to these dashboards, if you've enabled the Timers as noted above:\n\n- Mean Time to Assignment: Shows the average time to assignment for Incidents in the system where the Time to Assignment Timer was used.\n- Mean Time to Remediation (Remediation SLA): Shows the average time to remediation for Incidents where the Remediation SLA Timer was used.\n- My Mean Time to Remediation (Remediation SLA): Shows the average time to remediation for Incidents where the Owner is the viewing user.\n\nYou can add these Timers to existing or a new dashboard from the home screen!  If you're building your own playbooks, you can include these timers to track these metrics on those as well!\n\n## Dynamic Sections\n\nThe **CaseMgmtAnalystTools** automation script is used as a dynamic section on the layout to provide a list of quick links to Analysts to help them investigate the Incident.  \n\nTo create your own list, create an XSOAR list called \"+Case Management Analyst Tools+\", and add a Markdown Table with your own list.\n\nThe **CaseMgmtResponseProcess** automation script is used as a dynamic section to provide a response process on the Analyst Tools section of the layout.  This is customizable by Incident Type!\n\n## Additional Automations\n\nThe **CaseMgmtIncidentTypesDisplay** is a field display script that can be tied to the Type field.  Use this to restrict the Incident Types which are displayed to Analysts when created manually, and prevent changing the Incident Type from being changed on existing Incidents.  \n\nTo set this up:\n\n1. Create an XSOAR list (+Settings -\u003e Advanced -\u003e Lists+) called +IncidentTypesFromList+ with a comma seperated list of Incident Types to display (i.e. Case,Phishing,Malware)\n1. +Settings -\u003e Objects Setup -\u003e Incidents -\u003e Fields+\n2. Find and edit the Type field\n3. Select CaseMgmtIncidentTypesDisplay on the 'field display script' option\n\nYou can also use the **CaseMgmtIncidentTypesByRole** automaton to further breack this down by the users Roles!\n\n# What Next?\n\nWant to take it to the next level?  The next steps after implementing this pack might include the following:\n\n- Pivot incoming alerts from SIEMs etc to their own Incident types, with their own playbooks to automate away the mundane!\n- Use pre-processing rules to drop or link duplicate alerts!\n- Map data from incoming alerts to fields, allowing search ability, correlation of Incidents between different alert sources (i.e. map a username from different sources to the same field in XSOAR!)\n- Modify the Case layout on new types, replacing the labels section with the data from the incoming Incident that you mapped to fields.  This maintains a consistent look and feel for your Analysts, but places the information they need directly on the Incident.\n",
	"searchRank": 0,
	"serverMaxVersion": "",
	"serverMinVersion": "5.0.0",
	"support": "community",
	"supportDetails": {
		"email": "",
		"url": ""
	},
	"tags": [
		"Use Case",
		"Getting Started"
	],
	"toServerVersion": "",
	"updated": "2024-07-09T19:19:07Z",
	"useCases": [
		"Case Management"
	],
	"version": -1,
	"versionInfo": "1162940",
	"videos": []
}