{
	"author": "Cortex XSOAR",
	"authorImage": "content/packs/Base/Author_image.png",
	"beta": false,
	"cacheVersn": 0,
	"categories": [
		"Messaging And Conferencing"
	],
	"certification": "certified",
	"contentItemTypes": [
		"integration",
		"automation"
	],
	"contentItems": {
		"automation": [
			{
				"description": "Sends a message (question) to either user (in a direct message) or to a channel. The message includes predefined reply options. The response can also close a task (might be conditional) in a playbook.",
				"name": "ZoomAsk",
				"tags": [
					"zoom"
				]
			}
		],
		"classifier": null,
		"dashboard": null,
		"genericfield": null,
		"generictype": null,
		"incidentfield": null,
		"incidenttype": null,
		"indicatorfield": null,
		"integration": [
			{
				"category": "Identity and Access Management",
				"commands": [
					{
						"description": "Disable an active user.",
						"name": "iam-disable-user"
					},
					{
						"description": "Enable a deactivated user.",
						"name": "iam-enable-user"
					},
					{
						"description": "Retrieves a single user resource.",
						"name": "iam-get-user"
					},
					{
						"description": "Retrieves a User Profile schema, which holds all of the user fields within the application. Used for outgoing-mapping through the Get Schema option.",
						"name": "get-mapping-fields"
					}
				],
				"description": "An Identity and Access Management integration template.",
				"id": "Zoom_IAM",
				"name": "Zoom_IAM"
			},
			{
				"category": "Messaging and Conferencing",
				"commands": [
					{
						"description": "Send a message using a chatbot app.",
						"name": "send-notification"
					},
					{
						"description": "Create a new Zoom meeting (scheduled, instant, or recurring).",
						"name": "zoom-create-meeting"
					},
					{
						"description": "Sends chat messages on Zoom to either an individual user who is in your contact list or to a channel of which you are a member.  Use the command zoom-list-users to get the user id by the user email (for to_contact). Use the command zoom-list-user-channels in order to fetch the channel ID by the channel name (for to_channel). In order to send a message, you need to provide at least a message (message text) and to_contact (contact to send) or to_channel (channel to send to), but not both of them. In order to send a style message you need to provide is-markdown=true and the message can contain a markdown format. If you are using mention markdown in a message, provide the email address in the at_contact argument.\n",
						"name": "zoom-send-message"
					},
					{
						"description": "Invites members that are in a user's contact list to a channel. A channel can have one or more members. The maximum number of members that can be added at once with this API is 5. Use the command zoom-list-account-public-channels in order to fetch the channel ID by the channel name.\n",
						"name": "zoom-invite-to-channel"
					},
					{
						"description": "Creates a channel for a user. Use the existing command zoom-list-users to get the user ID by email (only if the user has an email address as part of the user parameters).\n",
						"name": "zoom-create-channel"
					},
					{
						"description": "Deletes a specific Zoom channel. Use the command zoom-list-account-public-channels  in order to fetch the channel ID by the channel name.\n",
						"name": "zoom-delete-channel"
					},
					{
						"description": "Update an existing channel in a Zoom account. Use the command zoom-list-account-public-channels in order to fetch the channel ID by the channel name. \"Need to provide at least one of the following arguments:  posting_permissions or channnel_name.\".",
						"name": "zoom-update-channel"
					},
					{
						"description": "Show all the meetings of a given user. Note: only scheduled and unexpired meetings will appear.\n",
						"name": "zoom-meeting-list"
					},
					{
						"description": "Deletes a chat message previously sent to a contact or a channel. Use the command zoom-list-user-channels  to get the channel ID by the channel name (for to_channel). See the existing command zoom-list-users to get the user ID by email (for to_contact). In order to update messages (or a single message using messageId), you need to provide  to_contact (contact to send) or to_channel (channel to send to), but not both of them.\n",
						"name": "zoom-delete-message"
					},
					{
						"description": "Edits a chat message that you previously sent to either a contact or a channel in Zoom by providing the ID of the message as the value of the messageId parameter.  As a query parameter, you must provide either the contact's email address of the contact or the Channel ID of the channel where the message was sent. Use the command zoom-list-user-channels to get the channel ID by the channel name (for to_channel). Use the existing command zoom-list-users to get the user ID by email (for to_contact). In order to update messages (or a single message using messageId), you need to provide to_contact (contact to send) or to_channel (channel to send to), but not both of them.\n",
						"name": "zoom-update-message"
					},
					{
						"description": "Get the information of an existing Zoom meeting.",
						"name": "zoom-meeting-get"
					},
					{
						"description": "List the existing channels You can only retrieve the channel information for the authorized user. In order to get a public channel by its name (for example Admins_to_delete_4)  you need to run the command zoom-list-account-public-channels without the channel_id param and find which channel_id fits the channel name.\n",
						"name": "zoom-list-account-public-channels"
					},
					{
						"description": "Delete a user from Zoom.",
						"name": "zoom-delete-user"
					},
					{
						"description": "Sends a file on Zoom to either an individual user in your contact list or a channel of which you are a member. Use existing command zoom-list-users to get the user ID by the user email (for to_contact). Use the command zoom-list-user-channels in order to fetch the channel ID by the channel name (for to_channel).\n",
						"name": "zoom-send-file"
					},
					{
						"description": "Removes a member from a chat channel. A channel can have one or more members. Use the command zoom-list-account-public-channels in order to fetch the channel ID by the channel name. In order get the user ID by the user email - use the existing command zoom-list-users.\n",
						"name": "zoom-remove-from-channel"
					},
					{
						"description": "Searches chat messages or shared files between a user and an individual contact or a chat channel. \n",
						"name": "zoom-list-messages"
					},
					{
						"description": "List the existing users.",
						"name": "zoom-list-users"
					},
					{
						"description": "List the existing channels. In order get the user ID by user email - use the existing command zoom-list-users.  In order to get the user channel by its name, run the command zoom-list-user-channels without the channel_id param and find which channel_id fits the channel name.\n",
						"name": "zoom-list-user-channels"
					},
					{
						"description": "Mirrors the investigation between Zoom and the Cortex XSOAR War Room.",
						"name": "mirror-investigation"
					},
					{
						"description": "Delete a mirrored Zoom channel.",
						"name": "close-channel"
					},
					{
						"description": "Create a new user in zoom account.",
						"name": "zoom-create-user"
					},
					{
						"description": "Get the meeting record and save it as a file in the War Room.",
						"name": "zoom-fetch-recording"
					}
				],
				"description": "Use the Zoom integration to manage your Zoom users and meetings.",
				"id": "Zoom",
				"name": "Zoom"
			}
		],
		"layoutscontainer": null,
		"list": null,
		"playbook": null,
		"report": null,
		"reputation": null,
		"widget": null,
		"wizard": null
	},
	"currentVersion": "1.6.10",
	"definitionId": "",
	"dependencies": {
		"Base": {
			"author": "Cortex XSOAR",
			"certification": "certified",
			"mandatory": true,
			"minVersion": "1.33.45",
			"name": "Base"
		}
	},
	"deprecated": false,
	"description": "Use the Zoom integration manage your Zoom users and meetings",
	"disabledMonthly": false,
	"downloads": 5588,
	"eulaLink": "https://github.com/demisto/content/blob/master/LICENSE",
	"fromServerVersion": "5.0.0",
	"general": [
		"generalFieldCertified",
		"generalFieldByCortexXSOAR",
		"generalFieldFree",
		"generalFieldSupportIncluded"
	],
	"id": "Zoom",
	"installMessage": "",
	"integrations": [
		{
			"imagePath": "content/packs/Zoom/Zoom_image.png",
			"name": "Zoom"
		},
		{
			"imagePath": "content/packs/Zoom/Zoom_IAM_image.png",
			"name": "Zoom_IAM"
		}
	],
	"itemVersion": "1.6.10",
	"keywords": [],
	"legacy": true,
	"name": "Zoom",
	"packID": "Zoom",
	"packName": "",
	"premium": false,
	"previewOnly": false,
	"price": 0,
	"propagationLabels": [
		"all"
	],
	"rawKeywords": null,
	"rawTags": null,
	"rawUseCases": null,
	"readme": "Zoom\n---\n#### About Zoom\nZoom allows users to create and join virtual meeting rooms where they can communicate with each other using video and audio. Additional features can give participants the ability to share their screen, share files, and use text chat within the meeting group or privately with others in the meeting\n\n#### What does this pack do?\n- Create and delete Zoom users.\n- Enable and disable Zoom users.\n- Create meetings.\n- Get info about meetings\n- Get info about Zoom users.\n- Get recordings of previous meetings.\n\n\n#### Pack Contents\n`Zoom_IAM` integration - Manage the Zoom_IAM instance within Cortex XSOAR.\n`Zoom` integration - Manage the Zoom instance within Cortex XSOAR.\n",
	"searchRank": 10,
	"serverMaxVersion": "",
	"serverMinVersion": "5.0.0",
	"support": "xsoar",
	"supportDetails": {
		"email": "",
		"url": "https://www.paloaltonetworks.com/cortex"
	},
	"tags": [
		"Trending"
	],
	"toServerVersion": "",
	"updated": "2024-10-21T19:26:11Z",
	"useCases": [],
	"version": -1,
	"versionInfo": "925751",
	"videos": []
}