contentitemexportablefields:
  contentitemfields:
    definitionid: ""
    fromServerVersion: 6.5.0
    itemVersion: 4.5.30
    packID: Microsoft365Defender
    packName: Microsoft 365 Defender
    packPropagationLabels:
    - all
    prevname: ""
    propagationLabels: []
    toServerVersion: ""
description: |-
  This playbook retrieves email data based on the `URLDomain` and `MessageID` inputs. It uses the Microsoft 365 Defender's Advanced Hunting to search only for URL click events based on the playbook inputs and enriches it with the full email data.

  **URLDomain** - If the “URLDomain” value is found as a substring of the URL(s) in the body of the email, the email is retrieved.

  **MessageID** - The message ID of the email from which the URL was clicked. Note that this can be either of the following 2 values:
  - The value of the header "Message-ID".
  - The internal ID of the message within Microsoft's products (e.g., NetworkMessageId).

  Can be a single MessageID or an array of MessageIDs to search.
id: Microsoft 365 Defender - Get Email URL Clicks
inputs:
- description: Represents a domain or URL. Can be a single domain or URL, or an array
    of domains or URLs to search. The search looks for URLs containing this input
    that were clicked within emails.
  key: URLDomain
  playbookInputQuery: null
  required: false
  value: {}
- description: |-
    MessageID of the email from which the URL was clicked. Note that this can be either of the following 2 values:
    - The value of the header "Message-ID".
    - The internal ID of the message within Microsoft's products (e.g., NetworkMessageId).

    Can be a single MessageID or an array of MessageIDs to search.
  key: MessageID
  playbookInputQuery: null
  required: false
  value: {}
- description: The time limit in seconds for the HTTP request to run. Default is 180.
  key: Timeout
  playbookInputQuery: null
  required: false
  value:
    simple: "180"
- description: Number of days past to search. Default is 7.
  key: SearchTimeframe
  playbookInputQuery: null
  required: false
  value:
    simple: "7"
- description: Number of retrieved entries. Enter -1 for unlimited query. 50 is the
    default.
  key: ResultsLimit
  playbookInputQuery: null
  required: false
  value:
    simple: "50"
- description: The mailbox of the listening integration. In case it is provided, the
    emails found in it will be ignored.
  key: ListenerMailbox
  playbookInputQuery: null
  required: false
  value: {}
name: Microsoft 365 Defender - Get Email URL Clicks
outputs:
- contextPath: Microsoft365Defender.RetrievedEmails.UrlCount
  description: Number of embedded URLs in the email.
  type: number
- contextPath: Microsoft365Defender.RetrievedEmails.InternetMessageId
  description: Public-facing identifier for the email that is set by the sending email
    system. This is the value of the "Message-ID" header.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.SenderFromDomain
  description: Sender domain in the FROM header, which is visible to email recipients
    on their email clients.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.EmailDirection
  description: 'Direction of the email relative to your network: Inbound, Outbound,
    Intra-org.'
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.AccountUpn
  description: User principal name (UPN) of the account.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.IsClickedThrough
  description: Indicates whether the user was able to click through to the original
    URL or not.
  type: number
- contextPath: Microsoft365Defender.RetrievedEmails.DeliveryLocation
  description: 'Location where the email was delivered: Inbox/Folder, On-premises/External,
    Junk, Quarantine, Failed, Dropped, Deleted items.'
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.AuthenticationDetails
  description: List of pass or fail verdicts by email authentication protocols like
    DMARC, DKIM, SPF or a combination of multiple authentication types (CompAuth).
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.DeliveryAction
  description: 'Delivery action of the email: Delivered, Junked, Blocked, or Replaced.'
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.BulkComplaintLevel
  description: Threshold assigned to emails from bulk mailers. A high bulk complain
    level (BCL) means the email is more likely to generate complaints, and thus more
    likely to be spam.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.Subject
  description: Subject of the email.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.AttachmentCount
  description: Number of attachments in the email.
  type: number
- contextPath: Microsoft365Defender.RetrievedEmails.IPAddress
  description: IP address assigned to the device during communication.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.DetectionMethods
  description: Methods used to detect whether the URL contains or leads to malware,
    phishing, or other threats.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.ThreatNames
  description: Detection name for malware or other threats found.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.Url
  description: URL that was clicked.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.ActionType
  description: Type of activity that triggered the event.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.RecipientEmailAddress
  description: Email address of the recipient, or email address of the recipient after
    distribution list expansion.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.EmailAction
  description: 'Final action taken on the email based on filter verdict, policies,
    and user actions: Move message to junk mail folder, Add X-header, Modify subject,
    Redirect message, Delete message, Send to quarantine, No action taken, Bcc message.'
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.UrlChain
  description: List of URLs in the redirection chain.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.NetworkMessageId
  description: Unique identifier for the email, generated by Office 365.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.SenderFromAddress
  description: Sender email address in the FROM header, which is visible to email
    recipients on their email clients.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.Timestamp
  description: Date and time when the record was generated (email event).
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.DisplayName
  description: Name of the sender displayed in the address book, typically a combination
    of a given or first name, a middle initial, and a last name or surname.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.SenderIPv4
  description: IPv4 address of the last detected mail server that relayed the message.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.ConfidenceLevel
  description: List of confidence levels of any spam or phishing verdicts. For spam,
    this column shows the spam confidence level (SCL), indicating if the email was
    skipped (-1), found to be not spam (0,1), found to be spam with moderate confidence
    (5,6), or found to be spam with high confidence (9). For phishing, this column
    displays whether the confidence level is "High" or "Low".
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.SenderMailFromDomain
  description: Sender domain in the MAIL FROM header, also known as the envelope sender
    or the Return-Path address.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.SenderIPv6
  description: IPv6 address of the last detected mail server that relayed the message.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.SenderMailFromAddress
  description: Sender email address in the MAIL FROM header, also known as the envelope
    sender or the Return-Path address.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.ThreatTypes
  description: Verdict from the email filtering stack on whether the email contains
    malware, phishing, or other threats.
  type: unknown
- contextPath: Microsoft365Defender.RetrievedEmails
  description: Email objects containing relevant fields related to URL click events.
  type: string
- contextPath: Microsoft365Defender.RetrievedEmails.ClickTimestamp
  description: Date and time when the record was generated (URL click).
  type: unknown
starttaskid: "0"
system: true
tasks:
  "0":
    continueonerrortype: ""
    id: "0"
    ignoreworker: false
    isautoswitchedtoquietmode: false
    isoversize: false
    nexttasks:
      '#none#':
      - "1"
    note: false
    quietmode: 0
    separatecontext: false
    skipunavailable: false
    task:
      brand: ""
      id: d1461914-ae1b-4f10-823c-159f52a5e77e
      iscommand: false
      name: ""
      version: -1
    taskid: d1461914-ae1b-4f10-823c-159f52a5e77e
    timertriggers: []
    type: start
    view: |-
      {
        "position": {
          "x": 50,
          "y": -20
        }
      }
  "1":
    continueonerrortype: ""
    id: "1"
    ignoreworker: false
    isautoswitchedtoquietmode: false
    isoversize: false
    nexttasks:
      "no":
      - "2"
      "yes":
      - "4"
      - "6"
    note: false
    quietmode: 0
    scriptarguments:
      brandname:
        simple: Microsoft 365 Defender
    separatecontext: false
    skipunavailable: false
    task:
      brand: ""
      description: Returns 'yes' if the integration brand is available. Otherwise
        returns 'no'.
      id: e5b1fef1-5ae6-4adc-8325-8598a638ada6
      iscommand: false
      name: Check if Microsoft 365 Defender is enabled
      script: IsIntegrationAvailable
      type: condition
      version: -1
    taskid: e5b1fef1-5ae6-4adc-8325-8598a638ada6
    timertriggers: []
    type: condition
    view: |-
      {
        "position": {
          "x": 50,
          "y": 160
        }
      }
  "2":
    continueonerrortype: ""
    id: "2"
    ignoreworker: false
    isautoswitchedtoquietmode: false
    isoversize: false
    note: false
    quietmode: 0
    separatecontext: false
    skipunavailable: false
    task:
      brand: ""
      id: d7d8f920-b7ae-4d22-8967-697d62f48db1
      iscommand: false
      name: Done
      type: title
      version: -1
    taskid: d7d8f920-b7ae-4d22-8967-697d62f48db1
    timertriggers: []
    type: title
    view: |-
      {
        "position": {
          "x": 50,
          "y": 1320
        }
      }
  "4":
    continueonerrortype: ""
    id: "4"
    ignoreworker: false
    isautoswitchedtoquietmode: false
    isoversize: false
    nexttasks:
      '#none#':
      - "9"
    note: false
    quietmode: 2
    scriptarguments:
      key:
        simple: URLDomainParsed
      value:
        complex:
          root: inputs.URLDomain
          transformers:
          - args:
              separator:
                value:
                  simple: ','
            operator: join
          - args:
              limit: {}
              replaceWith:
                value:
                  simple: '", "'
              toReplace:
                value:
                  simple: ','
            operator: replace
    separatecontext: false
    skipunavailable: false
    task:
      brand: ""
      description: |-
        Set a value in context under the key you entered. If no value is entered, the script doesn't do anything.

        This automation runs using the default Limited User role, unless you explicitly change the permissions.
        For more information, see the section about permissions here:
        https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.10/Cortex-XSOAR-Administrator-Guide/Automations
      id: af1be599-0f3e-42b0-8fc8-6bae609463fe
      iscommand: false
      name: Set URLDomain search argument
      script: SetAndHandleEmpty
      type: regular
      version: -1
    taskid: af1be599-0f3e-42b0-8fc8-6bae609463fe
    timertriggers: []
    type: regular
    view: |-
      {
        "position": {
          "x": 360,
          "y": 390
        }
      }
  "6":
    continueonerrortype: ""
    id: "6"
    ignoreworker: false
    isautoswitchedtoquietmode: false
    isoversize: false
    nexttasks:
      '#none#':
      - "9"
    note: false
    quietmode: 2
    scriptarguments:
      key:
        simple: MessageIDParsed
      value:
        complex:
          root: inputs.MessageID
          transformers:
          - args:
              separator:
                value:
                  simple: ', '
            operator: join
          - args:
              limit: {}
              replaceWith:
                value:
                  simple: '", "'
              toReplace:
                value:
                  simple: ', '
            operator: replace
    separatecontext: false
    skipunavailable: false
    task:
      brand: ""
      description: |-
        Set a value in context under the key you entered. If no value is entered, the script doesn't do anything.

        This automation runs using the default Limited User role, unless you explicitly change the permissions.
        For more information, see the section about permissions here:
        https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.10/Cortex-XSOAR-Administrator-Guide/Automations
      id: 8677b98b-b313-43ed-87b4-59f6c7bcce85
      iscommand: false
      name: Set MessageID search argument
      script: SetAndHandleEmpty
      type: regular
      version: -1
    taskid: 8677b98b-b313-43ed-87b4-59f6c7bcce85
    timertriggers: []
    type: regular
    view: |-
      {
        "position": {
          "x": 790,
          "y": 390
        }
      }
  "7":
    continueonerrortype: ""
    id: "7"
    ignoreworker: false
    isautoswitchedtoquietmode: false
    isoversize: false
    nexttasks:
      '#none#':
      - "11"
    note: false
    quietmode: 0
    scriptarguments:
      limit:
        complex:
          root: inputs.ResultsLimit
      query:
        simple: let _start = now(-${inputs.SearchTimeframe}d); EmailEvents | where
          Timestamp >= _start | where RecipientEmailAddress != "${inputs.ListenerMailbox}"
          | join UrlClickEvents on NetworkMessageId | where Url has_any ("${URLDomainParsed}")
          |  project-away AdditionalFields, EmailActionPolicy, UserLevelPolicy, EmailActionPolicyGuid,
          OrgLevelPolicy, UserLevelAction, EmailClusterId, ReportId, ReportId1, OrgLevelAction,
          SenderObjectId, NetworkMessageId1, DetectionMethods1, ThreatTypes1 |  project-rename
          ClickTimestamp = Timestamp1
      timeout:
        simple: ${inputs.Timeout}
    separatecontext: false
    skipunavailable: false
    task:
      brand: Microsoft 365 Defender
      description: 'Advanced hunting is a threat-hunting tool that uses specially
        constructed queries to examine the past 30 days of event data in Microsoft
        365 Defender. Details on how to write queries: https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-language?view=o365-worldwide.'
      id: f147d341-bb0e-4af5-8504-3b725e484f47
      iscommand: true
      name: Retrieve emails data (URLDomain)
      script: Microsoft 365 Defender|||microsoft-365-defender-advanced-hunting
      type: regular
      version: -1
    taskid: f147d341-bb0e-4af5-8504-3b725e484f47
    timertriggers: []
    type: regular
    view: |-
      {
        "position": {
          "x": 360,
          "y": 880
        }
      }
  "8":
    continueonerrortype: ""
    id: "8"
    ignoreworker: false
    isautoswitchedtoquietmode: false
    isoversize: false
    nexttasks:
      '#none#':
      - "11"
    note: false
    quietmode: 0
    scriptarguments:
      limit:
        complex:
          root: inputs.ResultsLimit
      query:
        simple: let _start = now(-${inputs.SearchTimeframe}d); EmailEvents | where
          Timestamp >= _start | where (InternetMessageId in ("${MessageIDParsed}")
          or NetworkMessageId in ("${MessageIDParsed}")) | join UrlClickEvents on
          NetworkMessageId | where RecipientEmailAddress != "${inputs.ListenerMailbox}"
          | project-away AdditionalFields, EmailActionPolicy, UserLevelPolicy, EmailActionPolicyGuid,
          OrgLevelPolicy, UserLevelAction, EmailClusterId, ReportId, ReportId1, OrgLevelAction,
          SenderObjectId, NetworkMessageId1, DetectionMethods1, ThreatTypes1 |  project-rename
          ClickTimestamp = Timestamp1
      timeout:
        simple: ${inputs.Timeout}
    separatecontext: false
    skipunavailable: false
    task:
      brand: Microsoft 365 Defender
      description: 'Advanced hunting is a threat-hunting tool that uses specially
        constructed queries to examine the past 30 days of event data in Microsoft
        365 Defender. Details on how to write queries: https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-language?view=o365-worldwide.'
      id: 09df3e7d-c6e7-40b2-8fe7-30834d9ee2d7
      iscommand: true
      name: Retrieve emails data (MessageID)
      script: Microsoft 365 Defender|||microsoft-365-defender-advanced-hunting
      type: regular
      version: -1
    taskid: 09df3e7d-c6e7-40b2-8fe7-30834d9ee2d7
    timertriggers: []
    type: regular
    view: |-
      {
        "position": {
          "x": 790,
          "y": 880
        }
      }
  "9":
    conditions:
    - condition:
      - - left:
            iscontext: true
            value:
              complex:
                root: inputs.URLDomain
          operator: isNotEmpty
          right:
            value: {}
      - - left:
            iscontext: true
            value:
              complex:
                root: inputs.MessageID
          operator: isEmpty
      label: URLDomain
    - condition:
      - - left:
            iscontext: true
            value:
              complex:
                root: inputs.MessageID
          operator: isNotEmpty
      - - left:
            iscontext: true
            value:
              complex:
                root: inputs.URLDomain
          operator: isEmpty
      label: MessageID
    - condition:
      - - left:
            iscontext: true
            value:
              complex:
                root: inputs.URLDomain
          operator: isNotEmpty
      - - left:
            iscontext: true
            value:
              complex:
                root: inputs.MessageID
          operator: isNotEmpty
      label: MessageID and URLDomain
    continueonerrortype: ""
    id: "9"
    ignoreworker: false
    isautoswitchedtoquietmode: false
    isoversize: false
    nexttasks:
      '#default#':
      - "2"
      MessageID:
      - "8"
      MessageID and URLDomain:
      - "10"
      URLDomain:
      - "7"
    note: false
    quietmode: 0
    separatecontext: false
    skipunavailable: false
    task:
      brand: ""
      id: afacdf6d-6f79-4824-8ed6-f4c8d7da2c58
      iscommand: false
      name: Check inputs
      type: condition
      version: -1
    taskid: afacdf6d-6f79-4824-8ed6-f4c8d7da2c58
    timertriggers: []
    type: condition
    view: |-
      {
        "position": {
          "x": 790,
          "y": 610
        }
      }
  "10":
    continueonerrortype: ""
    id: "10"
    ignoreworker: false
    isautoswitchedtoquietmode: false
    isoversize: false
    nexttasks:
      '#none#':
      - "11"
    note: false
    quietmode: 0
    scriptarguments:
      limit:
        complex:
          root: inputs.ResultsLimit
      query:
        simple: let _start = now(-${inputs.SearchTimeframe}d); EmailEvents | where
          Timestamp >= _start | where RecipientEmailAddress != "${inputs.ListenerMailbox}"
          | join UrlClickEvents on NetworkMessageId | where (InternetMessageId in
          ("${MessageIDParsed}") or NetworkMessageId in ("${MessageIDParsed}")) and
          Url has_any ("${URLDomainParsed}")  | project-away AdditionalFields, EmailActionPolicy,
          UserLevelPolicy, EmailActionPolicyGuid, OrgLevelPolicy, UserLevelAction,
          EmailClusterId, ReportId, ReportId1, OrgLevelAction, SenderObjectId, NetworkMessageId1,
          DetectionMethods1, ThreatTypes1 | project-rename ClickTimestamp = Timestamp1
      timeout:
        simple: ${inputs.Timeout}
    separatecontext: false
    skipunavailable: false
    task:
      brand: Microsoft 365 Defender
      description: 'Advanced hunting is a threat-hunting tool that uses specially
        constructed queries to examine the past 30 days of event data in Microsoft
        365 Defender. Details on how to write queries: https://docs.microsoft.com/en-us/microsoft-365/security/defender/advanced-hunting-query-language?view=o365-worldwide.'
      id: 91425086-ae2b-4662-84a5-71ce6f06c20a
      iscommand: true
      name: Retrieve emails data (MessageID and URLDomain)
      script: Microsoft 365 Defender|||microsoft-365-defender-advanced-hunting
      type: regular
      version: -1
    taskid: 91425086-ae2b-4662-84a5-71ce6f06c20a
    timertriggers: []
    type: regular
    view: |-
      {
        "position": {
          "x": 1210,
          "y": 880
        }
      }
  "11":
    continueonerrortype: ""
    id: "11"
    ignoreworker: false
    isautoswitchedtoquietmode: false
    isoversize: false
    nexttasks:
      '#none#':
      - "2"
    note: false
    quietmode: 0
    scriptarguments:
      key:
        simple: Microsoft365Defender.RetrievedEmails
      value:
        complex:
          accessor: results
          root: Microsoft365Defender.Hunt
    separatecontext: false
    skipunavailable: false
    task:
      brand: ""
      description: |-
        Set a value in context under the key you entered. If no value is entered, the script doesn't do anything.

        This automation runs using the default Limited User role, unless you explicitly change the permissions.
        For more information, see the section about permissions here:
        https://docs-cortex.paloaltonetworks.com/r/Cortex-XSOAR/6.10/Cortex-XSOAR-Administrator-Guide/Automations
      id: 8fabf2a2-8171-4794-85ca-d42d4f78b7eb
      iscommand: false
      name: Set RetrievedEmails field
      script: SetAndHandleEmpty
      type: regular
      version: -1
    taskid: 8fabf2a2-8171-4794-85ca-d42d4f78b7eb
    timertriggers: []
    type: regular
    view: |-
      {
        "position": {
          "x": 790,
          "y": 1100
        }
      }
version: -1
view: |-
  {
    "linkLabelsPosition": {
      "1_2_no": 0.29,
      "9_10_MessageID and URLDomain": 0.6,
      "9_2_#default#": 0.51
    },
    "paper": {
      "dimensions": {
        "height": 1405,
        "width": 1540,
        "x": 50,
        "y": -20
      }
    }
  }
